import React from "react";
import styles from "./BlogHeader.module.css";
import { assests, BlogHeaderData } from "../../assets/assests";

const BlogHeader = () => {
  return (
    <>
      <div className={styles.banner}>
        {BlogHeaderData.map((blog, index) => (
          <>
            <div className={styles.upperoverlay}>
              <div className={styles.overlay}>
                <h1 className={styles.title}>{blog.title}</h1>
                <h1 className={styles.title}>{blog.title2}</h1>
                <p className={styles.subtitle}>{blog.subTitle}</p>
                <p className={styles.subtitle}>{blog.subTitle2}</p>
                <p className={styles.subtitle}>{blog.name}</p>
                <span className={styles.date}>{blog.date}</span>
              </div>
            </div>

            <div className={styles.topContainer}></div>
          </>
        ))}
      </div>

      <div className={styles.articleContainer}>
        <div className={styles.textContainer}>
          <h1>
            احصل على تحديثات الشركة والتغطية الصحفية والوصول إلى التنزيلات
            الإعلامية
          </h1>
          <p>
            في كتابه المهم "مذكرات مخرج سينمائي" يقول سيرجي آيزنشتاين "كيف أصبحت
            مخرجًا سينمائيًا؟ حدث ذلك منذ زمن بعيد منذ حوالي ثلاثين عام مضى
            لكنني أذكر بوضوح كيف بدأت حياتي الفنية، انطباعان متلاحقان هما اللذان
            قررا مصيري: الأول كان مشاهدتي لمسرحية توراندوت التي أخرجها كوميرز
            فسكي وقدمها مسرح نزلوبين خلال جولته في ريجا عام 1913، أصبح المسرح
            اهتمامي الوحيد وقتها، وبعدها كانت مسرحية ماسكاريد التي جعلتني أستبدل
            الهندسة بالفن. فيما بعد هذا التحول أكد أكثر من مرة أن فكرة التعاون
            مع فريق العمل والممثلين تحديدًا، يعني كل شيء له كمخرج يقدم كل أفكاره
            عن طريق هذا الممثل.
          </p>
          <h2>واصل مع البطل بكل كيانك</h2>
        </div>
        <div className={styles.imageContainer}>
          <img src={assests.rectangle21} alt="Description" />
        </div>
        <div className={styles.textContainer2}></div>
        <div className={styles.textContainer}>
          <p className={styles.para}>
            العلاقة بين المخرج والممثل هي واحدة من أكثر العلاقات تقديسًا في
            صناعة السينما. بعيدًا عن علاقة المخرج بالمنتجين ومؤلفي السيناريو
            ومصوري السينما وملحني الموسيقى والمصممين وأعضاء الطاقم. يتحمل المخرج
            مسؤولية توازن العلاقات مع جميع أعضاء الفريق هؤلاء، لكن العلاقة بين
            المخرج والممثل تقدم فرصًا وتحديات فريدة يظهر من خلالها توافق كل
            الاختيارات الأخرى.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            التواصل بين المخرج والممثل هو عملية تعاونية من لحظة قراءة النص إلى
            الانتهاء. سواء كان فيلم هوليوودي جماهيري أو في مشروع قصير للأفلام في
            المدرسة حتى.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            إذا لم تعمل مع ممثل من قبل، قم بالبحث عنه للتعرف عليه. ويمكنك أيضًا
            الاتصال بمخرجين آخرين قد عملوا مع هذا الممثل والاستفسار عن عملهم
            المشترك وما طريقة العمل التي يفضلها، إذا كنت تتعامل مع ممثل هاو في
            فيلمك الجديد، تعرف على حياته أكثر، عليك أن تعرفه وتحبه كي يتمكن من
            إيصال ما تريد بأفضل طريقة ممكنة.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            {" "}
            قم بإشراك الممثلين في عملية الإعداد: اسأل الممثلين إذا كانوا يودون
            النظر في قائمة اللقطات الخاصة بك، وفهم الديكوباج، أو أي شيء آخر قد
            قمت به في التحضير. ذلك يتيح لهم خدمة رؤيتك بشكل أفضل.
          </p>
        </div>

        <div className={styles.textContainer}>
          <h2>واصل مع البطل بكل كيانك</h2>
          <p className={styles.para}>
            العلاقة بين المخرج والممثل هي واحدة من أكثر العلاقات تقديسًا في
            صناعة السينما. بعيدًا عن علاقة المخرج بالمنتجين ومؤلفي السيناريو
            ومصوري السينما وملحني الموسيقى والمصممين وأعضاء الطاقم. يتحمل المخرج
            مسؤولية توازن العلاقات مع جميع أعضاء الفريق هؤلاء، لكن العلاقة بين
            المخرج والممثل تقدم فرصًا وتحديات فريدة يظهر من خلالها توافق كل
            الاختيارات الأخرى.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            التواصل بين المخرج والممثل هو عملية تعاونية من لحظة قراءة النص إلى
            الانتهاء. سواء كان فيلم هوليوودي جماهيري أو في مشروع قصير للأفلام في
            المدرسة حتى.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            إذا لم تعمل مع ممثل من قبل، قم بالبحث عنه للتعرف عليه. ويمكنك أيضًا
            الاتصال بمخرجين آخرين قد عملوا مع هذا الممثل والاستفسار عن عملهم
            المشترك وما طريقة العمل التي يفضلها، إذا كنت تتعامل مع ممثل هاو في
            فيلمك الجديد، تعرف على حياته أكثر، عليك أن تعرفه وتحبه كي يتمكن من
            إيصال ما تريد بأفضل طريقة ممكنة.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            {" "}
            قم بإشراك الممثلين في عملية الإعداد: اسأل الممثلين إذا كانوا يودون
            النظر في قائمة اللقطات الخاصة بك، وفهم الديكوباج، أو أي شيء آخر قد
            قمت به في التحضير. ذلك يتيح لهم خدمة رؤيتك بشكل أفضل.
          </p>
          <h2>واصل مع البطل بكل كيانك</h2>
          <p className={styles.para}>
            العلاقة بين المخرج والممثل هي واحدة من أكثر العلاقات تقديسًا في
            صناعة السينما. بعيدًا عن علاقة المخرج بالمنتجين ومؤلفي السيناريو
            ومصوري السينما وملحني الموسيقى والمصممين وأعضاء الطاقم. يتحمل المخرج
            مسؤولية توازن العلاقات مع جميع أعضاء الفريق هؤلاء، لكن العلاقة بين
            المخرج والممثل تقدم فرصًا وتحديات فريدة يظهر من خلالها توافق كل
            الاختيارات الأخرى.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            التواصل بين المخرج والممثل هو عملية تعاونية من لحظة قراءة النص إلى
            الانتهاء. سواء كان فيلم هوليوودي جماهيري أو في مشروع قصير للأفلام في
            المدرسة حتى.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            إذا لم تعمل مع ممثل من قبل، قم بالبحث عنه للتعرف عليه. ويمكنك أيضًا
            الاتصال بمخرجين آخرين قد عملوا مع هذا الممثل والاستفسار عن عملهم
            المشترك وما طريقة العمل التي يفضلها، إذا كنت تتعامل مع ممثل هاو في
            فيلمك الجديد، تعرف على حياته أكثر، عليك أن تعرفه وتحبه كي يتمكن من
            إيصال ما تريد بأفضل طريقة ممكنة.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            {" "}
            قم بإشراك الممثلين في عملية الإعداد: اسأل الممثلين إذا كانوا يودون
            النظر في قائمة اللقطات الخاصة بك، وفهم الديكوباج، أو أي شيء آخر قد
            قمت به في التحضير. ذلك يتيح لهم خدمة رؤيتك بشكل أفضل.
          </p>
        </div>
      </div>

      <div className={styles.articleContainer}>
        <div className={styles.imageContainer}>
          <img src={assests.rectangle22} alt="Description" />
        </div>
        <div className={styles.textContainer}>
          <p className={styles.para}>
            العلاقة بين المخرج والممثل هي واحدة من أكثر العلاقات تقديسًا في
            صناعة السينما. بعيدًا عن علاقة المخرج بالمنتجين ومؤلفي السيناريو
            ومصوري السينما وملحني الموسيقى والمصممين وأعضاء الطاقم. يتحمل المخرج
            مسؤولية توازن العلاقات مع جميع أعضاء الفريق هؤلاء، لكن العلاقة بين
            المخرج والممثل تقدم فرصًا وتحديات فريدة يظهر من خلالها توافق كل
            الاختيارات الأخرى.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            التواصل بين المخرج والممثل هو عملية تعاونية من لحظة قراءة النص إلى
            الانتهاء. سواء كان فيلم هوليوودي جماهيري أو في مشروع قصير للأفلام في
            المدرسة حتى.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            إذا لم تعمل مع ممثل من قبل، قم بالبحث عنه للتعرف عليه. ويمكنك أيضًا
            الاتصال بمخرجين آخرين قد عملوا مع هذا الممثل والاستفسار عن عملهم
            المشترك وما طريقة العمل التي يفضلها، إذا كنت تتعامل مع ممثل هاو في
            فيلمك الجديد، تعرف على حياته أكثر، عليك أن تعرفه وتحبه كي يتمكن من
            إيصال ما تريد بأفضل طريقة ممكنة.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            {" "}
            قم بإشراك الممثلين في عملية الإعداد: اسأل الممثلين إذا كانوا يودون
            النظر في قائمة اللقطات الخاصة بك، وفهم الديكوباج، أو أي شيء آخر قد
            قمت به في التحضير. ذلك يتيح لهم خدمة رؤيتك بشكل أفضل.
          </p>
        </div>

        <div className={styles.textContainer}>
          <h2>واصل مع البطل بكل كيانك</h2>
          <p className={styles.para}>
            العلاقة بين المخرج والممثل هي واحدة من أكثر العلاقات تقديسًا في
            صناعة السينما. بعيدًا عن علاقة المخرج بالمنتجين ومؤلفي السيناريو
            ومصوري السينما وملحني الموسيقى والمصممين وأعضاء الطاقم. يتحمل المخرج
            مسؤولية توازن العلاقات مع جميع أعضاء الفريق هؤلاء، لكن العلاقة بين
            المخرج والممثل تقدم فرصًا وتحديات فريدة يظهر من خلالها توافق كل
            الاختيارات الأخرى.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            التواصل بين المخرج والممثل هو عملية تعاونية من لحظة قراءة النص إلى
            الانتهاء. سواء كان فيلم هوليوودي جماهيري أو في مشروع قصير للأفلام في
            المدرسة حتى.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            إذا لم تعمل مع ممثل من قبل، قم بالبحث عنه للتعرف عليه. ويمكنك أيضًا
            الاتصال بمخرجين آخرين قد عملوا مع هذا الممثل والاستفسار عن عملهم
            المشترك وما طريقة العمل التي يفضلها، إذا كنت تتعامل مع ممثل هاو في
            فيلمك الجديد، تعرف على حياته أكثر، عليك أن تعرفه وتحبه كي يتمكن من
            إيصال ما تريد بأفضل طريقة ممكنة.
          </p>
          <p className={styles.para}>&nbsp;</p>
          <p className={styles.para}>
            {" "}
            قم بإشراك الممثلين في عملية الإعداد: اسأل الممثلين إذا كانوا يودون
            النظر في قائمة اللقطات الخاصة بك، وفهم الديكوباج، أو أي شيء آخر قد
            قمت به في التحضير. ذلك يتيح لهم خدمة رؤيتك بشكل أفضل.
          </p>

          <div className={styles.textContainer}>
            <h2>واصل مع البطل بكل كيانك</h2>
            <p className={styles.para}>
              العلاقة بين المخرج والممثل هي واحدة من أكثر العلاقات تقديسًا في
              صناعة السينما. بعيدًا عن علاقة المخرج بالمنتجين ومؤلفي السيناريو
              ومصوري السينما وملحني الموسيقى والمصممين وأعضاء الطاقم. يتحمل
              المخرج مسؤولية توازن العلاقات مع جميع أعضاء الفريق هؤلاء، لكن
              العلاقة بين المخرج والممثل تقدم فرصًا وتحديات فريدة يظهر من خلالها
              توافق كل الاختيارات الأخرى.
            </p>
            <p className={styles.para}>&nbsp;</p>
            <p className={styles.para}>
              التواصل بين المخرج والممثل هو عملية تعاونية من لحظة قراءة النص إلى
              الانتهاء. سواء كان فيلم هوليوودي جماهيري أو في مشروع قصير للأفلام
              في المدرسة حتى.
            </p>
            <p className={styles.para}>&nbsp;</p>
            <p className={styles.para}>
              إذا لم تعمل مع ممثل من قبل، قم بالبحث عنه للتعرف عليه. ويمكنك
              أيضًا الاتصال بمخرجين آخرين قد عملوا مع هذا الممثل والاستفسار عن
              عملهم المشترك وما طريقة العمل التي يفضلها، إذا كنت تتعامل مع ممثل
              هاو في فيلمك الجديد، تعرف على حياته أكثر، عليك أن تعرفه وتحبه كي
              يتمكن من إيصال ما تريد بأفضل طريقة ممكنة.
            </p>
            <p className={styles.para}>&nbsp;</p>
            <p className={styles.para}>
              {" "}
              قم بإشراك الممثلين في عملية الإعداد: اسأل الممثلين إذا كانوا يودون
              النظر في قائمة اللقطات الخاصة بك، وفهم الديكوباج، أو أي شيء آخر قد
              قمت به في التحضير. ذلك يتيح لهم خدمة رؤيتك بشكل أفضل.
            </p>
          </div>
        </div>
      </div>
    </>
  );
};

export default BlogHeader;
